import { myConditions } from '@utils/Data';
import './About.scss';

const page = () => {

  return (
    <div className='about'>

        <div className='about-div'>
            <h1>منصة Rent Nest لايجار العقارات</h1>
            <p>Rent Nest هي منصة شاملة تلبي احتياجاتك الإيجارية حصريًا داخل الأردن. يقدم Rent Nest مجموعة من العقارات بما في ذلك الشاليهات والمنتجعات والمنازل، ويضمن إقامة ممتعة لأولئك الذين يبحثون عن ملاذات جبلية مريحة أو ملاذات على شاطئ البحر أو ملاذات ريفية هادئة. سواء كنت تخطط لقضاء إجازة عائلية أو بوابة، فإن مجموعة Rent Nest المتنوعة من أماكن الإقامة تعدك بالراحة والملاءمة. بالإضافة إلى ذلك، بالنسبة للمسافرين الذين يحتاجون إلى عجلات لاستكشاف وجهتهم المختارة، توفر Rent Nest صفحة لتأجير السيارات بشكل ملائم. اكتشف جمال الأردن بينما تستمتع بضيافة رفيعة المستوى من خلال قوائم Rent Nest المنسقة.</p>
        </div>

        <div id='conditions'>
            <hr />
            <h2>شروط و أحكام المنصة</h2>
            <ul>
                {myConditions().map((item) => (
                    <li>{item}</li>
                ))}
            </ul>
        </div>

    </div>
  )
};

export default page;
